In [1]:
import pandas as pd

# Import csv file

In [2]:
data = pd.read_csv(r"/Users/Private/Downloads/busan-air-quality.csv")

# See data snapshot

In [3]:
data

            date pm25 pm10  o3 no2 so2  co
0     2015/01/03   89   60  na  55  22  45
1     2015/01/04  113   97  na  66  46  37
2     2015/01/05  153   50  na  29  18   8
3     2015/01/06  101   37  na  73  36  38
4     2015/01/07   85   64  na  81  40  41
...          ...  ...  ...  ..  ..  ..  ..
2849  2022/12/27   76   47  28  32   3   3
2850  2022/12/28  101   40  27  25   4   3
2851  2022/12/29   85   46  28  33   3   3
2852  2022/12/30  102   37  30  24   3   3
2853  2022/12/31   86   50  38  25   5   4

[2854 rows x 7 columns]

# See first 5 rows of data

In [4]:
data.head()

         date pm25 pm10  o3 no2 so2  co
0  2015/01/03   89   60  na  55  22  45
1  2015/01/04  113   97  na  66  46  37
2  2015/01/05  153   50  na  29  18   8
3  2015/01/06  101   37  na  73  36  38
4  2015/01/07   85   64  na  81  40  41

# See data info (# of rows, columns)

In [6]:
data.shape

(2854, 7)

In [7]:
data.index

RangeIndex(start=0, stop=2854, step=1)

# See column names

In [8]:
data.columns

Index(['date', 'pm25', 'pm10', 'o3', 'no2', 'so2', 'co'], dtype='object')

# See data types

In [9]:
data.dtypes

date    object
pm25    object
pm10    object
o3      object
no2     object
so2     object
co      object
dtype: object

# See unique values by column name

In [13]:
data['pm25'].unique()

array(['89', '113', '153', '101', '85', '108', '114', '122', '126', '105',
       '121', '145', '103', '68', '217', '133', '96', '112', '134', '140',
       '78', '76', '88', '110', '144', '155', '95', '67', '127', '74',
       '99', '161', '123', '116', '136', '119', '77', '83', '141', '111',
       '146', '80', '128', '87', '69', '90', '97', '139', '118', '104',
       '102', '142', '147', '234', '71', '81', '106', '117', '107', '86',
       '124', '148', '94', '82', '65', '307', '92', '75', '63', '115',
       '163', '151', '158', '130', '152', '138', '170', '137', '150',
       '149', '120', '125', '156', '143', '100', '72', '159', '162',
       '164', '73', '135', '93', '61', '58', '60', '79', '64', '91',
       '131', '47', '51', '160', '70', '98', '109', '84', 'na', '166',
       '171', '132', '168', '66', '57', '129', '52', '55', '59', '62',
       '154', '175', '49', '46', '40', '157', '56', '54', '53', '42',
       '44', '48', '50', '167', '169', '36', '31', '29', '43', '23', '45',
       '38', '41', '28', '27', '180', '34', '39', '37', '35', '32', '24',
       '26', '30', '33'], dtype=object)

# See # of unique values per column

In [14]:
data.nunique()

date    2854
pm25     153
pm10     100
o3       108
no2       82
so2       43
co        20
dtype: int64

# See # of rows of data per column

In [15]:
data.count()

date    2854
pm25    2854
pm10    2854
o3      2854
no2     2854
so2     2854
co      2854
dtype: int64

# See # of instances of values

In [17]:
data['pm25'].value_counts()

83     51
66     48
70     46
74     46
68     45
       ..
163     1
307     1
234     1
217     1
33      1
Name: pm25, Length: 153, dtype: int64

#

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2854 entries, 0 to 2853
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2854 non-null   object
 1   pm25    2854 non-null   object
 2   pm10    2854 non-null   object
 3   o3      2854 non-null   object
 4   no2     2854 non-null   object
 5   so2     2854 non-null   object
 6   co      2854 non-null   object
dtypes: object(7)
memory usage: 156.2+ KB

# Question 1: Find all of the unique 'co' values.

In [19]:
data.head(2)

         date pm25 pm10  o3 no2 so2  co
0  2015/01/03   89   60  na  55  22  45
1  2015/01/04  113   97  na  66  46  37

In [20]:
data.nunique()

date    2854
pm25     153
pm10     100
o3       108
no2       82
so2       43
co        20
dtype: int64

In [22]:
data['co'].nunique()

20

In [23]:
data['co'].unique()

array(['45', '37', '8', '38', '41', '7', '10', '9', '11', '12', '14',
       '13', '5', '16', '6', '4', '3', 'na', '2', '1'], dtype=object)

# Question 2: Find the number of times 'co' is '1'

In [24]:
data.head(2)

         date pm25 pm10  o3 no2 so2  co
0  2015/01/03   89   60  na  55  22  45
1  2015/01/04  113   97  na  66  46  37

In [25]:
#value_counts()

data.co.value_counts()

4     637
5     595
3     520
6     386
7     264
8     152
2     139
9      68
10     37
11     16
na     13
12     10
13      6
1       4
14      2
16      1
37      1
41      1
38      1
45      1
Name: co, dtype: int64

In [27]:
#filtering

data[data.co == '1']

            date pm25 pm10  o3 no2 so2 co
2378  2021/09/12   74   30  41  17   7  1
2698  2022/07/29   71   21  29  12   5  1
2707  2022/08/07   59   30  29  16   3  1
2714  2022/08/14   60   22  23  10   4  1

In [28]:
#filtering boolean result

data.co == '1'

0       False
1       False
2       False
3       False
4       False
        ...
2849    False
2850    False
2851    False
2852    False
2853    False
Name: co, Length: 2854, dtype: bool

In [31]:
#groupby
#data.head(2)

data.groupby('co').get_group('1')

            date pm25 pm10  o3 no2 so2 co
2378  2021/09/12   74   30  41  17   7  1
2698  2022/07/29   71   21  29  12   5  1
2707  2022/08/07   59   30  29  16   3  1
2714  2022/08/14   60   22  23  10   4  1

# Question 3: Find the number of times 'pm25' was exactly '307'

In [32]:
data.head(2)

         date pm25 pm10  o3 no2 so2  co
0  2015/01/03   89   60  na  55  22  45
1  2015/01/04  113   97  na  66  46  37

In [55]:
data[data['pm25'] == '307']

          date pm25 pm10  o3 no2 so2 co
93  2015/04/06  307   53  35  30  13  6

In [89]:
data.pm25_microdust.value_counts()

83.0     51
66.0     48
70.0     46
74.0     46
68.0     45
         ..
163.0     1
307.0     1
234.0     1
217.0     1
33.0      1
Name: pm25_microdust, Length: 152, dtype: int64

# Question 4: Find the null values in the data

In [56]:
data.isnull()

       date   pm25   pm10     o3    no2    so2     co
0     False  False  False  False  False  False  False
1     False  False  False  False  False  False  False
2     False  False  False  False  False  False  False
3     False  False  False  False  False  False  False
4     False  False  False  False  False  False  False
...     ...    ...    ...    ...    ...    ...    ...
2849  False  False  False  False  False  False  False
2850  False  False  False  False  False  False  False
2851  False  False  False  False  False  False  False
2852  False  False  False  False  False  False  False
2853  False  False  False  False  False  False  False

[2854 rows x 7 columns]

In [57]:
data.isnull().sum()

date    0
pm25    0
pm10    0
o3      0
no2     0
so2     0
co      0
dtype: int64

In [58]:
data.notnull().sum()

date    2854
pm25    2854
pm10    2854
o3      2854
no2     2854
so2     2854
co      2854
dtype: int64

# Question 5: Rename the column 'pm25' with 'pm25_microdust'

In [59]:
data.head(2)

         date pm25 pm10  o3 no2 so2  co
0  2015/01/03   89   60  na  55  22  45
1  2015/01/04  113   97  na  66  46  37

In [61]:
#temporarycommand
data.rename(columns = {'pm25' : 'pm25_microdust'})

            date pm25_microdust pm10  o3 no2 so2  co
0     2015/01/03             89   60  na  55  22  45
1     2015/01/04            113   97  na  66  46  37
2     2015/01/05            153   50  na  29  18   8
3     2015/01/06            101   37  na  73  36  38
4     2015/01/07             85   64  na  81  40  41
...          ...            ...  ...  ..  ..  ..  ..
2849  2022/12/27             76   47  28  32   3   3
2850  2022/12/28            101   40  27  25   4   3
2851  2022/12/29             85   46  28  33   3   3
2852  2022/12/30            102   37  30  24   3   3
2853  2022/12/31             86   50  38  25   5   4

[2854 rows x 7 columns]

In [64]:
#permanentcommand
data.rename(columns = {'pm25' : 'pm25_microdust'}, inplace = True)

In [65]:
data.head(2)

         date pm25_microdust pm10  o3 no2 so2  co
0  2015/01/03             89   60  na  55  22  45
1  2015/01/04            113   97  na  66  46  37

# Question 6: What is the mean, standard deviation, and variance 'pm25_microdust'?

In [70]:
#converting data type from string to numeric

data.pm25_microdust = pd.to_numeric(data.pm25_microdust, errors='coerce')

In [71]:
data.pm25_microdust.mean()

87.91693065821893

In [72]:
data.pm25_microdust.std()

29.88304901079335

In [73]:
data.pm25_microdust.var()

892.9966181814774

# Question 7: Find all instances when 'na' was recorded

In [74]:
data.head(2)

         date  pm25_microdust pm10  o3 no2 so2  co
0  2015/01/03            89.0   60  na  55  22  45
1  2015/01/04           113.0   97  na  66  46  37

In [75]:
data.pm25_microdust.value_counts()

83.0     51
66.0     48
70.0     46
74.0     46
68.0     45
         ..
163.0     1
307.0     1
234.0     1
217.0     1
33.0      1
Name: pm25_microdust, Length: 152, dtype: int64

In [87]:
data[data.pm25_microdust == 'na']

Empty DataFrame
Columns: [date, pm25_microdust, pm10, o3, no2, so2, co]
Index: []

# Question 7: Show how many instances where 'pm25_microdust' is lower than '50'

In [90]:
data.head(2)

         date  pm25_microdust pm10  o3 no2 so2  co
0  2015/01/03            89.0   60  na  55  22  45
1  2015/01/04           113.0   97  na  66  46  37

In [100]:
data[data['pm25_microdust']<50]

            date  pm25_microdust pm10  o3 no2 so2  co
234   2015/08/25            47.0   31  32  27  11   5
919   2017/08/02            49.0   na  na  na  na  na
921   2017/08/07            46.0   43  43  46  14   6
924   2017/08/10            40.0   na  na  na  na  na
1214  2018/07/03            42.0   36  34  22  14   6
...          ...             ...  ...  ..  ..  ..  ..
2822  2022/11/30            47.0   22  28  18   4   3
2823  2022/12/01            48.0   27  25  26   2   3
2826  2022/12/04            45.0   28  23  20   4   2
2827  2022/12/05            30.0   41  27  27   5   3
2839  2022/12/17            49.0   18  26  15   3   2

[198 rows x 7 columns]